rasusmilch/PT100_Mesh_Datalogger/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_APP_REPRODUCIBLE_BUILD=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_n8r2_8mb_ota.csv"
CONFIG_APP_WIFI_ROUTER_SSID="NSYS_VT"
CONFIG_APP_WIFI_ROUTER_PASSWORD="N0rt3ch1!"
CONFIG_APP_MAX31865_WIRES_2=y
CONFIG_APP_MAX31865_FILTER_60HZ=y
CONFIG_APP_SD_CS_GPIO=14
CONFIG_APP_FRAM_FLUSH_WATERMARK_RECORDS_DEFAULT=512
CONFIG_APP_SD_BATCH_BYTES_TARGET=24576
CONFIG_APP_I2C_SDA_GPIO=8
CONFIG_APP_I2C_SCL_GPIO=9
CONFIG_COMPILER_OPTIMIZATION_NONE=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_WIFI_FTM_ENABLE=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=64
CONFIG_HEAP_POISONING_COMPREHENSIVE=y
CONFIG_HEAP_TRACING_STANDALONE=y
CONFIG_LWIP_L2_TO_L3_COPY=y
CONFIG_LWIP_TCP_MSS=624
CONFIG_MESH_LITE_ENABLE=y
CONFIG_ESP_TIMER_TASK_STACK_SIZE=4096
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096